# BeforeExecuted Event (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInCommandBinding..::..BeforeExecuted Event
AddInCommandBinding Class See Also
---
Occurs before the command associated with this AddInCommandBinding executes.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public event EventHandler<BeforeExecutedEventArgs> BeforeExecuted
```

Visual Basic
---
```text
Public Event BeforeExecuted As EventHandler(Of BeforeExecutedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<BeforeExecutedEventArgs^>^ BeforeExecuted {
	void add (EventHandler<BeforeExecutedEventArgs^>^ value);
	void remove (EventHandler<BeforeExecutedEventArgs^>^ value);
}
```

# See Also
AddInCommandBinding Class
Autodesk.Revit.UI Namespace